Revit 2027 API
ParameterTypeId.StructuralSectionCommonTorsionalMomentOfInertia Property
 "Torsional Moment of Inertia"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionCommonTorsionalMomentOfInertia { get; }
Public Shared ReadOnly Property StructuralSectionCommonTorsionalMomentOfInertia As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionCommonTorsionalMomentOfInertia {
	ForgeTypeId^ get ();
}
static member StructuralSectionCommonTorsionalMomentOfInertia : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace